app/controllers/api/admin/missions_controller.rb

    def index
        @missions = Mission.all
---
SELECT "missions".* FROM "missions"

    def create
        @mission = Mission.new(mission_params)
        if @mission.save
---
INSERT INTO "missions" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "Mission test 1"], ["created_at", "2018-08-15 21:31:09.206501"], ["updated_at", "2018-08-15 21:31:09.206501"]]

    def update
      if @mission.update(mission_params)
---
UPDATE "missions" SET "content" = ?, "updated_at" = ? WHERE "missions"."id" = ?

    def destroy
        @mission.destroy
---
DELETE FROM "missions" WHERE "missions"."id" = ?  [["id", 1]]

        def find_mission
            @mission = Mission.find(params[:id])
---
SELECT  "missions".* FROM "missions" WHERE "missions"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]