app/controllers/api/admin/visions_controller.rb

    def index
        @visions = Vision.all
---
SELECT "visions".* FROM "visions"